---
kind: type
id: T:Autodesk.Revit.DB.Architecture.PostPattern
source: html/3368dd15-79bc-3116-6ced-4fc123d6300d.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern

Post pattern class.

## Syntax (C#)
```csharp
public class PostPattern : IDisposable
```